S2sSARNN2(
  (embed): Embedding(8, 128)
  (encoder): EncoderSARNN2(
    (emb): Embedding(8, 128)
    (sa1): TransformerEncoderLayer(
      (self_attn): MultiheadAttention(
        (out_proj): NonDynamicallyQuantizableLinear(in_features=128, out_features=128, bias=True)
      )
      (linear1): Linear(in_features=128, out_features=1024, bias=True)
      (dropout): Dropout(p=0.1, inplace=False)
      (linear2): Linear(in_features=1024, out_features=128, bias=True)
      (norm1): LayerNorm((128,), eps=1e-05, elementwise_affine=True)
      (norm2): LayerNorm((128,), eps=1e-05, elementwise_affine=True)
      (dropout1): Dropout(p=0.1, inplace=False)
      (dropout2): Dropout(p=0.1, inplace=False)
    )
    (sa2): TransformerEncoderLayer(
      (self_attn): MultiheadAttention(
        (out_proj): NonDynamicallyQuantizableLinear(in_features=128, out_features=128, bias=True)
      )
      (linear1): Linear(in_features=128, out_features=1024, bias=True)
      (dropout): Dropout(p=0.1, inplace=False)
      (linear2): Linear(in_features=1024, out_features=128, bias=True)
      (norm1): LayerNorm((128,), eps=1e-05, elementwise_affine=True)
      (norm2): LayerNorm((128,), eps=1e-05, elementwise_affine=True)
      (dropout1): Dropout(p=0.1, inplace=False)
      (dropout2): Dropout(p=0.1, inplace=False)
    )
    (gru): GRU(128, 128, batch_first=True, bidirectional=True)
  )
  (decoder): AttentionalRNNDecoder(
    (proj): Linear(in_features=256, out_features=128, bias=True)
    (attn): ContentBasedAttention(
      (mlp_enc): Linear(in_features=256, out_features=128, bias=True)
      (mlp_dec): Linear(in_features=128, out_features=128, bias=True)
      (mlp_attn): Linear(in_features=128, out_features=1, bias=False)
      (mlp_out): Linear(in_features=256, out_features=128, bias=True)
      (softmax): Softmax(dim=-1)
    )
    (drop): Dropout(p=0.0, inplace=False)
    (rnn): GRUCell(
      (rnn_cells): ModuleList(
        (0): GRUCell(256, 128)
      )
      (dropout_layers): ModuleList()
    )
    (emb): Embedding(8, 128)
  )
  (lm_head): Linear(in_features=128, out_features=8, bias=True)
)
Num of param: 1,123,464