Seq2seqRNN(
  (embed): Embedding(8, 256)
  (encoder): EncoderRNN(
    (emb): Embedding(8, 256)
    (gru): GRU(256, 256, batch_first=True, bidirectional=True)
  )
  (decoder): AttentionalRNNDecoder(
    (proj): Linear(in_features=512, out_features=256, bias=True)
    (attn): ContentBasedAttention(
      (mlp_enc): Linear(in_features=512, out_features=256, bias=True)
      (mlp_dec): Linear(in_features=256, out_features=256, bias=True)
      (mlp_attn): Linear(in_features=256, out_features=1, bias=False)
      (mlp_out): Linear(in_features=512, out_features=256, bias=True)
      (softmax): Softmax(dim=-1)
    )
    (drop): Dropout(p=0.0, inplace=False)
    (rnn): GRUCell(
      (rnn_cells): ModuleList(
        (0): GRUCell(512, 256)
      )
      (dropout_layers): ModuleList()
    )
    (emb): Embedding(8, 256)
  )
  (lm_head): Linear(in_features=256, out_features=8, bias=True)
)
Num of param: 1,845,000